<?php

/**
 * 個人關係物件
 * @package person
 * @since 0.0.0
 */ 
class relation {

	/**
	 * 母親欄位
	 * @
	 * @ 提供鍵入搜尋
	 * @
	 */
	$mother;
	
	/**
	 * 父親欄位
	 * @
	 * @ 提供鍵入搜尋
	 * @
	 */
	$father;
	
	/**
	 * 兒子欄位
	 * @
	 * @ 提供鍵入搜尋
	 * @
	 */
	$son;
	
	/**
	 * 女兒欄位
	 * @
	 * @ 提供鍵入搜尋
	 * @
	 */
	$daughter;
	
	/**
	 * 妻子欄位
	 * @
	 * @
	 * @
	 */
	$wife;
	
	/**
	 * 丈夫欄位
	 * @
	 * @
	 * @
	 */
	$husband;
	
	/**
	 * 欄位
	 * @
	 * @ 
	 * @
	 */
	$
	
	/**
	 * 欄位
	 * @
	 * @ 
	 * @
	 */
	$
	
	/**
	 * 欄位
	 * @
	 * @ 
	 * @
	 */
	$
	
	/**
	 * 欄位
	 * @
	 * @ 
	 * @
	 */
	$
	
	/**
	 * 欄位
	 * @
	 * @ 
	 * @
	 */
	$
	
	/**
	 * 欄位
	 * @
	 * @ 
	 * @
	 */
	$
}
 
 
?>